<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release version of OpenJDK 11 and imports into a Munki repository.</string>
    <key>Identifier</key>
    <string>com.github.mkuron.munki.OpenJDK11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenJDK11</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utility/Oracle</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utility</string>
            <key>developer</key>
            <string>Oracle</string>
            <key>description</key>
            <string>The JDK is a development environment for building applications, applets, and components using the Java programming language. The JDK includes tools useful for developing and testing programs written in the Java programming language and running on the Java platform.</string>
            <key>display_name</key>
            <string>Java 11 development kit</string>
        	<key>minimum_os_version</key>
        	<string>10.11</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>supported_architectures</key>
			<array>
			   <string>x86_64</string>
			</array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.OpenJDK11</string>
    <key>Process</key>
    <array>
		<!-- Import into Munki -->
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
